ScarsFun/CH32V006_ST7789_DMA/User/WCHst7789.c
/*
 * Fast ST7789 DMA Library for CH32V006
 *
 PA4 BL
 PA5 CS
 PA1 DC
 PA0 RST
 PD2  SCK
 PD3  MOSI
 */
#include <ch32v00X.h>
#include <ch32v00X_gpio.h>
#include "WCHst7789_cfg.h"
#include "WCHst7789.h"
#include "stdlib.h"

#define TFT_BL_H() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_BL_Pin, Bit_SET)
#define TFT_BL_L() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_BL_Pin, Bit_RESET)
#define TFT_CS_H() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_CS_Pin, Bit_SET)
#define TFT_CS_L() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_CS_Pin, Bit_RESET)
#define TFT_DC_D() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_DC_Pin, Bit_SET)
#define TFT_DC_C() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_DC_Pin, Bit_RESET)
#define TFT_RES_H() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_RES_Pin, Bit_SET)
#define TFT_RES_L() GPIO_WriteBit(ST7789_CS_GPIO_Port, ST7789_RES_Pin, Bit_RESET)

#define SWAP_INT16_T(a, b) \
    {                      \
        int16_t t = a;     \
        a = b;             \
        b = t;             \
    }
#define DELAY 0x80
uint8_t Y_SHIFT = 0, X_SHIFT = 0;
static uint8_t _value_rotation = 0;

static int16_t _height = ST7789_TFTHEIGHT, _width = ST7789_TFTWIDTH;
volatile uint32_t flag_DMA_CH3_bsy = 0;

static const uint8_t
    cmd_240x240[] = { // Initialization commands for 7789 screens
        9, // 9 commands in list:
        ST7789_SWRESET, DELAY, // 1: Software reset, no args, w/delay
        150, // 150 ms delay
        ST7789_SLPOUT, DELAY, // 2: Out of sleep mode, no args, w/delay
        10, // 255 = 500 ms delay
        ST7789_COLMOD, 1 + DELAY, // 3: Set color mode, 1 arg + delay:
        0x55, // 16-bit color
        10, // 10 ms delay
        ST7789_MADCTL, 1, // 4: Memory access ctrl (directions), 1 arg:
        0x00, // Row addr/col addr, bottom to top refresh
        ST7789_CASET, 4, //  5: Column addr set, 4 args, no delay:
        0x00,
        0, //     XSTART = 0
        0,
        240, //     XEND = 240
        ST7789_RASET, 4, //  6: Row addr set, 4 args, no delay:
        0x00,
        0, //     YSTART = 0
        320 >> 8,
        320 & 0xFF, //     YEND = 320
        ST7789_INVON, DELAY, // 7: Inversion ON
        10,
        ST7789_NORON, DELAY, // 8: Normal display on, no args, w/delay
        10, // 10 ms delay
        ST7789_DISPON, DELAY, // 9: Main screen turn on, no args, w/delay
        255
    }; // 255 = 500 ms delay

//static void ST7789_GPIO_Init(void);
static void ST7789_WriteCommand(uint8_t cmd);
static void ST7789_WriteData(uint8_t* buff, size_t buff_size);
static void ST7789_ExecuteCommandList(const uint8_t* addr);
static void ST7789_SetAddressWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1);

static void Send_Data8(uint8_t data);
static void Send_Data16(uint16_t data);
static void Send_DMA_Data16(uint16_t*, uint16_t);

void ST7789_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOA, ENABLE);
    GPIO_InitStructure.GPIO_Pin = ST7789_RES_Pin |  ST7789_DC_Pin | ST7789_CS_Pin | ST7789_BL_Pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_30MHz;
    GPIO_Init(ST7789_CS_GPIO_Port, &GPIO_InitStructure);
}

void SPI1_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    SPI_InitTypeDef  SPI_InitStructure = {0};

    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOD | RCC_PB2Periph_SPI1 | RCC_PB2Periph_AFIO, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap2_SPI1, ENABLE);

    // SCK
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_30MHz;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

    // MOSI
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_30MHz;
    GPIO_Init(GPIOD, &GPIO_InitStructure);


    SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Tx;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(SPI1, &SPI_InitStructure);

    SPI_I2S_DMACmd(SPI1, SPI_I2S_DMAReq_Tx, ENABLE);

    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA1, ENABLE);
    DMA_DeInit(DMA1_Channel3);

    //Set DMA1 - Channel 3, Very high priority, 16bit size, mem -> spi direction
    //No memory or perpheral increment
    DMA1_Channel3->CFGR |= DMA_CFGR1_PL_0 | DMA_CFGR1_PL_1 | DMA_CFGR1_PSIZE_0 \
                        | DMA_CFGR1_MSIZE_0 | DMA_CFGR1_DIR;                    
    //Take SPI1 Data register address
    DMA1_Channel3->PADDR = (uint32_t)&SPI1->DATAR;
    //Enable DMA interrupt for channel 3
    NVIC_EnableIRQ(DMA1_Channel3_IRQn);

    SPI_Cmd(SPI1, ENABLE);
}

void Send_Data8(uint8_t data)
{
    SPI_DATA_8B();
    while((SPI1->STATR & SPI_STATR_TXE) != SPI_STATR_TXE){};
    SPI1->DATAR = data;
    while((SPI1->STATR & SPI_STATR_BSY) == SPI_STATR_BSY){};
}

void Send_Data16(uint16_t data)
{
    SPI_DATA_16B();
    while((SPI1->STATR & SPI_STATR_TXE) != SPI_STATR_TXE){};
    SPI1->DATAR = data;
    while((SPI1->STATR & SPI_STATR_BSY) == SPI_STATR_BSY){};
}

uint8_t spi_recv8(uint8_t dummy)
{
    SPI1->DATAR = dummy;
    while((SPI1->STATR & SPI_STATR_RXNE) != SPI_STATR_RXNE){};
    
    return (uint8_t)SPI1->DATAR;
}

void Send_DMA_Data16(uint16_t *data, uint16_t size)
{
    //Change data length to 16bit
    SPI_DATA_16B();
    //First disable DMA
    DMA1_Channel3->CFGR &= ~DMA_CFGR3_EN;
    //Buffer address
    DMA1_Channel3->MADDR = (uint32_t)data;
    //Number of data transfer
    DMA1_Channel3->CNTR = (uint16_t)size;
    //Enable DMA Channel
    DMA1_Channel3->CFGR |= DMA_CFGR3_EN;    
    //Wait end of transfer
	while((DMA1->INTFR & DMA_TCIF3) != DMA_TCIF3){};
	//Clear DMA global flag  
	DMA1->INTFCR |= DMA_CGIF3;
}



static void ST7789_Reset()
{
    TFT_RES_L();
    Delay_Us(20);
    TFT_RES_H();
    Delay_Us(150);
}

static void ST7789_WriteCommand(uint8_t cmd)
{
    TFT_DC_C();
    Send_Data8(cmd);
}

static void ST7789_WriteData(uint8_t* buff, size_t buff_size)
{

    TFT_DC_D();

    for (uint16_t index = 0; index < buff_size; index++) {
        Send_Data8(buff[index]);
    }
}

static void ST7789_ExecuteCommandList(const uint8_t* addr)
{
    uint8_t numCommands, numArgs;
    uint16_t ms;

