ScarsFun/CH32V006_ST7789_DMA/User/WCHst7789.c
    numCommands = *addr++;
    while (numCommands--) {
        uint8_t cmd = *addr++;
        ST7789_WriteCommand(cmd);

        numArgs = *addr++;
        // If high bit set, delay follows args
        ms = numArgs & DELAY;
        numArgs &= ~DELAY;
        if (numArgs) {
            ST7789_WriteData((uint8_t*)addr, numArgs);
            addr += numArgs;
        }

        if (ms) {
            ms = *addr++;
            if (ms == 255)
                ms = 500;
            Delay_Us(ms);
        }
    }
}

static void ST7789_SetAddressWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{

    uint16_t x_start = x0 + X_SHIFT, x_end = x1 + X_SHIFT;
    uint16_t y_start = y0 + Y_SHIFT, y_end = y1 + Y_SHIFT;

    /* Column Address set */
    ST7789_WriteCommand(ST7789_CASET);
    {
        uint8_t data[] = { x_start >> 8, x_start & 0xFF, x_end >> 8, x_end & 0xFF };
        ST7789_WriteData(data, sizeof(data));
    }

    /* Row Address set */
    ST7789_WriteCommand(ST7789_RASET);
    {
        uint8_t data[] = { y_start >> 8, y_start & 0xFF, y_end >> 8, y_end & 0xFF };
        ST7789_WriteData(data, sizeof(data));
    }
    /* Write to RAM */
    ST7789_WriteCommand(ST7789_RAMWR);
}
void ST7789_Init()
{
    ST7789_GPIO_Init();
    SPI1_Init();

    TFT_CS_L();
    ST7789_Reset();
    ST7789_ExecuteCommandList(cmd_240x240);

    TFT_CS_H();
}

void ST7789_DrawPixel(uint16_t x, uint16_t y, uint16_t color)
{
    if ((x >= _width) || (y >= _height))
        return;

    TFT_CS_L();

    ST7789_SetAddressWindow(x, y, x + 1, y + 1);
    uint8_t data[] = { color >> 8, color & 0xFF };
    ST7789_WriteData(data, sizeof(data));

    TFT_CS_H();
}

void ST7789_FillRectangle(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
    // clipping

    if ((x >= _width) || (y >= _height))
        return;
    if ((x + w - 1) >= _width)
        w = _width - x;
    if ((y + h - 1) >= _height)
        h = _height - y;

    TFT_CS_L();
    ST7789_SetAddressWindow(x, y, x + w - 1, y + h - 1);
    TFT_DC_D();
    // DMA Memory increment disabled
    DMA1_Channel3->CFGR &= ~DMA_CFGR1_MINC;	
    uint16_t tbuf = color;
    Send_DMA_Data16(&tbuf, w * h);
    // DMA Memory increment enabled	
    DMA1_Channel3->CFGR |= DMA_CFGR1_MINC;
    TFT_CS_H();
}

void ST7789_FillScreen(uint16_t color)
{
    ST7789_FillRectangle(0, 0, _width, _height, color);
}

void ST7789_DrawImage(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t* data)
{
    if ((x >= _width) || (y >= _height))
        return;
    if ((x + w - 1) >= _width)
        return;
    if ((y + h - 1) >= _height)
        return;

    TFT_CS_L();
    ST7789_SetAddressWindow(x, y, x + w - 1, y + h - 1);
    TFT_DC_D();
    Send_DMA_Data16((uint16_t*)data, w * h);
    TFT_CS_H();
}

void ST7789_InvertColors(bool invert)
{
    TFT_CS_L();
    ST7789_WriteCommand(invert ? ST7789_INVON : ST7789_INVOFF);
    TFT_CS_H();
}

void ST7789_Backlight_On(void)
{
    TFT_BL_H();
}

void ST7789_Backlight_Off(void)
{
    TFT_BL_L();
}

/***************************************************************************************
** Function name:           drawCircle
** Description:             Draw a circle outline
***************************************************************************************/
void ST7789_DrawCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color)
{
    int16_t f = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -r - r;
    int16_t x = 0;

    ST7789_DrawPixel(x0 + r, y0, color);
    ST7789_DrawPixel(x0 - r, y0, color);
    ST7789_DrawPixel(x0, y0 - r, color);
    ST7789_DrawPixel(x0, y0 + r, color);

    while (x < r) {
        if (f >= 0) {
            r--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        ST7789_DrawPixel(x0 + x, y0 + r, color);
        ST7789_DrawPixel(x0 - x, y0 + r, color);
        ST7789_DrawPixel(x0 - x, y0 - r, color);
        ST7789_DrawPixel(x0 + x, y0 - r, color);

        ST7789_DrawPixel(x0 + r, y0 + x, color);
        ST7789_DrawPixel(x0 - r, y0 + x, color);
        ST7789_DrawPixel(x0 - r, y0 - x, color);
        ST7789_DrawPixel(x0 + r, y0 - x, color);
    }
}

/***************************************************************************************
** Function name:           drawCircleHelper
** Description:             Support function for circle drawing
***************************************************************************************/
void ST7789_DrawCircleHelper(int16_t x0, int16_t y0, int16_t r, uint8_t cornername, uint16_t color)
{
    int16_t f = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -2 * r;
    int16_t x = 0;

    while (x < r) {
        if (f >= 0) {
            r--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;
        if (cornername & 0x8) {
            ST7789_DrawPixel(x0 - r, y0 + x, color);
            ST7789_DrawPixel(x0 - x, y0 + r, color);
        }
        if (cornername & 0x4) {
            ST7789_DrawPixel(x0 + x, y0 + r, color);
            ST7789_DrawPixel(x0 + r, y0 + x, color);
        }
        if (cornername & 0x2) {
            ST7789_DrawPixel(x0 + r, y0 - x, color);
            ST7789_DrawPixel(x0 + x, y0 - r, color);
        }
        if (cornername & 0x1) {
            ST7789_DrawPixel(x0 - x, y0 - r, color);
            ST7789_DrawPixel(x0 - r, y0 - x, color);
        }
    }
}

/***************************************************************************************
** Function name:           fillCircle
** Description:             draw a filled circle
***************************************************************************************/
void ST7789_FillCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color)
{
    ST7789_DrawFastVLine(x0, y0 - r, r + r + 1, color);
    ST7789_FillCircleHelper(x0, y0, r, 3, 0, color);
}

/***************************************************************************************
** Function name:           fillCircleHelper
** Description:             Support function for filled circle drawing
***************************************************************************************/
// Used to do circles and roundrects
void ST7789_FillCircleHelper(int16_t x0, int16_t y0, int16_t r, uint8_t cornername, int16_t delta, uint16_t color)
{
    int16_t f = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -r - r;
    int16_t x = 0;

    delta++;
    while (x < r) {
        if (f >= 0) {
            r--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

