ScarsFun/CH32V006_ST7789_DMA/User/WCHst7789.c
    // Sort coordinates by Y order (y2 >= y1 >= y0)
    if (y0 > y1) {
        SWAP_INT16_T(y0, y1);
        SWAP_INT16_T(x0, x1);
    }

    if (y1 > y2) {
        SWAP_INT16_T(y2, y1);
        SWAP_INT16_T(x2, x1);
    }

    if (y0 > y1) {
        SWAP_INT16_T(y0, y1);
        SWAP_INT16_T(x0, x1);
    }

    if (y0 == y2) { // Handle awkward all-on-same-line case as its own thing
        a = b = x0;
        if (x1 < a)
            a = x1;
        else if (x1 > b)
            b = x1;
        if (x2 < a)
            a = x2;
        else if (x2 > b)
            b = x2;
        ST7789_DrawFastHLine(a, y0, b - a + 1, color);
        return;
    }

    int16_t
        dx01 = x1 - x0,
        dy01 = y1 - y0,
        dx02 = x2 - x0,
        dy02 = y2 - y0,
        dx12 = x2 - x1,
        dy12 = y2 - y1,
        sa = 0,
        sb = 0;

    // For upper part of triangle, find scanline crossings for segments
    // 0-1 and 0-2.  If y1=y2 (flat-bottomed triangle), the scanline y1
    // is included here (and second loop will be skipped, avoiding a /0
    // error there), otherwise scanline y1 is skipped here and handled
    // in the second loop...which also avoids a /0 error here if y0=y1
    // (flat-topped triangle).
    if (y1 == y2)
        last = y1; // Include y1 scanline
    else
        last = y1 - 1; // Skip it

    for (y = y0; y <= last; y++) {
        a = x0 + sa / dy01;
        b = x0 + sb / dy02;
        sa += dx01;
        sb += dx02;

        if (a > b)
            SWAP_INT16_T(a, b);
        ST7789_DrawFastHLine(a, y, b - a + 1, color);
    }

    // For lower part of triangle, find scanline crossings for segments
    // 0-2 and 1-2.  This loop is skipped if y1=y2.
    sa = dx12 * (y - y1);
    sb = dx02 * (y - y0);
    for (; y <= y2; y++) {
        a = x1 + sa / dy12;
        b = x0 + sb / dy02;
        sa += dx12;
        sb += dx02;

        if (a > b)
            SWAP_INT16_T(a, b);
        ST7789_DrawFastHLine(a, y, b - a + 1, color);
    }
}

/***************************************************************************************
** Function name:           drawLine
** Description:             draw a line between 2 arbitrary points
***************************************************************************************/

// Slower but more compact line drawing function
void ST7789_DrawLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color)
{
    int16_t steep = abs(y1 - y0) > abs(x1 - x0);
    if (steep) {
        SWAP_INT16_T(x0, y0);
        SWAP_INT16_T(x1, y1);
    }

    if (x0 > x1) {
        SWAP_INT16_T(x0, x1);
        SWAP_INT16_T(y0, y1);
    }

    int16_t dx, dy;
    dx = x1 - x0;
    dy = abs(y1 - y0);

    int16_t err = dx / 2;
    int16_t ystep;

    if (y0 < y1) {
        ystep = 1;
    }
    else {
        ystep = -1;
    }

    for (; x0 <= x1; x0++) {
        if (steep) {
            ST7789_DrawPixel(y0, x0, color);
        }
        else {
            ST7789_DrawPixel(x0, y0, color);
        }
        err -= dy;
        if (err < 0) {
            y0 += ystep;
            err += dx;
        }
    }
}

/***************************************************************************************
** Function name:           drawFastVLine
** Description:             draw a vertical line
***************************************************************************************/
void ST7789_DrawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color)
{

    // Rudimentary clipping
    if ((x >= _width) || (y >= _height))
        return;
    if ((y + h - 1) >= _height)
        h = _height - y;

#ifdef USE_SPI_DMA
    ST7789_FillRectangle(x, y, 1, h, color);
#else
    ST7789_DrawLine(x, y, x, y + h - 1, color);
#endif
}

/***************************************************************************************
** Function name:           drawFastHLine
** Description:             draw a horizontal line
***************************************************************************************/
void ST7789_DrawFastHLine(int16_t x, int16_t y, int16_t w, uint16_t color)
{
    // Rudimentary clipping

    if ((x >= _width) || (y >= _height))
        return;
    if ((x + w - 1) >= _width)
        w = _width - x;

#ifdef USE_SPI_DMA
    ST7789_FillRectangle(x, y, w, 1, color);
#else
    ST7789_DrawLine(x, y, x + w - 1, y, color);
#endif
}

/***************************************************************************************
** Function name:           setRotation
** Description:             rotate the screen orientation m = 0-3
***************************************************************************************/
void ST7789_SetRotation(uint8_t m)
{
    _value_rotation = m % 4;

    TFT_CS_L();

    ST7789_WriteCommand(ST7789_MADCTL);

    switch (_value_rotation) {
    case 0: {
        uint8_t d_r = (ST7789_MADCTL_MX | ST7789_MADCTL_MY | ST7789_MADCTL_RGB);
        ST7789_WriteData(&d_r, sizeof(d_r));
        _width = ST7789_TFTWIDTH;
        _height = ST7789_TFTHEIGHT;
        X_SHIFT = 0;
        Y_SHIFT = 80;
    } break;
    case 1: {
        uint8_t d_r = (ST7789_MADCTL_MY | ST7789_MADCTL_MV | ST7789_MADCTL_RGB);
        ST7789_WriteData(&d_r, sizeof(d_r));
        _width = ST7789_TFTHEIGHT;
        _height = ST7789_TFTWIDTH;
        X_SHIFT = 80;
        Y_SHIFT = 0;
    } break;
    case 2: {
        uint8_t d_r = (ST7789_MADCTL_RGB);
        ST7789_WriteData(&d_r, sizeof(d_r));
        _width = ST7789_TFTWIDTH;
        _height = ST7789_TFTHEIGHT;
        X_SHIFT = 0;
        Y_SHIFT = 0;
    } break;
    case 3: {
        uint8_t d_r = (ST7789_MADCTL_MX | ST7789_MADCTL_MV | ST7789_MADCTL_RGB);
        ST7789_WriteData(&d_r, sizeof(d_r));
        _width = ST7789_TFTHEIGHT;
        _height = ST7789_TFTWIDTH;
        X_SHIFT = 0;
        Y_SHIFT = 0;
    } break;
    }
    TFT_CS_H();
}

uint8_t ST7789_GetRotation(void)
{
    return _value_rotation;
}

int16_t ST7789_GetHeight(void)
{
    return _height;
}

int16_t ST7789_GetWidth(void)
{
    return _width;
}

uint8_t get_bit_from_byte(uint8_t byte, uint8_t bit)
{
    return byte & (1 << bit);
}

void ST7789_DrawChar(char ch, const uint8_t font[], uint16_t X, uint16_t Y, uint16_t color, uint16_t bgcolor)
{
    if ((ch < 31) || (ch > 127))
        return;

    uint8_t fOffset, fWidth, fHeight, fBPL;
    uint8_t* tempChar;

